IDEA Open Model
ConcreteCheckResultBase Class
Compatible with IDEA StatiCa Beta 20.0
 Concrete result base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 More...
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class ConcreteCheckResultBase
Public MustInherit Class ConcreteCheckResultBase
The ConcreteCheckResultBase type exposes the following members.
Constructors
Name | Description
ConcreteCheckResultBase
 Constructor
Top
Properties
Name | Description
Check
 settings of check type
CheckValue
 calculated limited value, calculated as strain to limit strain
InternalFores
 internal forces used for calculation
LimitCheckValue
 limit check value for result check
NonConformities
 Returns nonconformity in section
Result
 check result passed/failed
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckDetailing
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteSLSCheckResultCrackWidth
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteSLSCheckResultStiffness
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteSLSCheckResultStressLimitation
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultDiagramCapacity
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultFatigue
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultInteraction
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultResponse
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultShear
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultTorsion